#+begin_src canvas
r = (cosf(500*x*y+5*t) + 1) / 2;
g = (cosf(520*x*y+5*t) + 1) / 2;
b = (cosf(10*x*y+5*t) + 1) / 2;
#+end_src

#+RESULTS:
: {CANVAS}
